runTestCases/initialCases/01_channel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
( 
  "lib_FG_MoE_incompressibleRAS"
) ;


application				PysimpleFoam;

//startFrom       		latestTime;
startFrom       		startTime;

startTime       		0;

stopAt          		nextWrite;

endTime         	  1;

deltaT          		2e-4;

writeControl    		adjustableRunTime;

writeInterval   		1;

purgeWrite      		1;

writeFormat     		ascii;
//writeFormat     		binary;

writePrecision   		6;

writeCompression 		off;

timeFormat      		general;

timePrecision   		8;

adjustTimeStep			no;

runTimeModifiable 		true;

maxCo 					0.6;


functions
{

turbulenceFields1
{
    // Mandatory entries (unmodifiable)
    type            turbulenceFields;
    libs            (fieldFunctionObjects);
    fields           (R);
    enabled         true;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
}

yPlus
{
    // Mandatory entries (unmodifiable)
    type            yPlus;
    libs            (fieldFunctionObjects);
    enabled         false;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
}

volAvgU
  {
    // Mandatory entries (unmodifiable)
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    enabled         false;
    fields          (U);
    operation       volAverage;
    regionType      all;
    writeFields     false;
    executeControl  timeStep;
    executeInterval 10;
    writeControl    timeStep;
    writeInterval   10;
  }

	Average
   {
		type            fieldAverage;
		libs 			( "libfieldFunctionObjects.so" );
		enabled         false;
		timeStart	300;
		writeControl    writeTime ;
       fields
       (
       	  U
          {
              mean        	on;
              prime2Mean 	on;
              base        	time;
          }
		  p
          {
              mean        	on;
              prime2Mean 	on;
              base        	time;
          }
		  fd
          {
              mean        	on;
              prime2Mean 	off;
              base        	time;
          }
		  CDES
		  {
              mean        	on;
              prime2Mean 	off;
              base        	time;
          }
		  k
		  {
			  mean        	on;
              prime2Mean 	off;
              base        	time;		  
		  }
		  omega
		  {
			  mean        	on;
              prime2Mean 	off;
              base        	time;		  
		  }
		turbulenceProperties:R
		  {
			  mean        	on;
              prime2Mean 	off;
              base        	time;		  
		  }
		nonlinearR
		 {
			  mean        	on;
              			prime2Mean 	off;
              			base        	time;		  
		  }


       );
   }

/*
	write
	{
		type            writeObjects;
		libs		("libutilityFunctionObjects.so");

		objects         (rho thermo:mu);

		writeControl    writeTime;
	}
*/
}

// ************************************************************************* //
