runTestCases/initialCases/01_channel/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
120
(
0.00682423
0.00693154
0.00694692
0.00683269
0.00653825
0.00612692
0.00566312
0.00517972
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    sides1_half01
    {
        type            empty;
    }
    sides1_half11
    {
        type            empty;
    }
    sides2_half01
    {
        type            empty;
    }
    sides2_half11
    {
        type            empty;
    }
    topWall
    {
        type            zeroGradient;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
