runTestCases/initialCases/01_channel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                  PCG;
        preconditioner          DIC;
        tolerance               1e-7;
        relTol                  0.01;
    }

    pFinal
    {
       $p;
       relTol               0.;
    }

    "(h|U|k|omega|e)"
    {
        solver              PBiCGStab;
        preconditioner      DILU;
        tolerance           1e-7;
        relTol              0.01;
    }

    "(h|U|k|omega|e)Final"
    {
        $U;
        relTol              0.;
    }
}

PIMPLE
{
    nOuterCorrectors 5;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        11;
    pRefValue       0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    /*
    residualControl
    {
        p           1e-3;
        U           1e-7;
        "(k|epsilon|omega)" 1e-7;
    }
    */

}

relaxationFactors
{
    fields
    {
        "(p|pFinal)"               0.4;
    }
    equations
    {
        "(U|UFinal)"               0.8;
        "(k|kFinal)"               0.8;
        "(omega|omegaFinal)"       0.8;
        "(nuTilda|nuTildaFinal)"   0.8;
    }
}


// ************************************************************************* //
